Revit 2027 API
ExportLinetypeTable.GetExportLinetypeInfo Method
 Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeInfo GetExportLinetypeInfo(
	ExportLinetypeKey exportLinetypeKey
)
Public Function GetExportLinetypeInfo (
	exportLinetypeKey As ExportLinetypeKey
) As ExportLinetypeInfo
public:
ExportLinetypeInfo^ GetExportLinetypeInfo(
	ExportLinetypeKey^ exportLinetypeKey
)
member GetExportLinetypeInfo :
        exportLinetypeKey : ExportLinetypeKey -> ExportLinetypeInfo
Parameters
exportLinetypeKey ExportLinetypeKey
 The export line type Key.
Return Value
ExportLinetypeInfo
 Returns the line type info for this key.
Exceptions
Exception | Condition
ArgumentException |  An entry with the given key is not present in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace